In [2]:
import numpy as np
import pandas as pd

In [3]:
#获取数据，数据基本信息
train_data = pd.read_csv("./titanic/train.csv")
test_data = pd.read_csv(r"./titanic/test.csv")
gender_data = pd.read_csv(r"./titanic/gender_submission.csv")
train_data.head()
# train_data.info()
# train_data.describe()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
#查看数据缺失值
total = train_data.isnull().sum().sort_values(ascending = False)
percent = round(total/len(train_data)*100,2)
pd.concat([total,percent],axis = 1,keys = ["total","percent"])

             total  percent
Cabin          687    77.10
Age            177    19.87
Embarked         2     0.22
Fare             0     0.00
Ticket           0     0.00
Parch            0     0.00
SibSp            0     0.00
Sex              0     0.00
Name             0     0.00
Pclass           0     0.00
Survived         0     0.00
PassengerId      0     0.00

In [20]:
#Embarked缺失值处理
print(train_data[train_data.Embarked.isnull()])
total = train_data.Embarked.value_counts(dropna=False)
percent = total/len(train_data)*100
pd.concat([total,percent],axis=1,keys=["total","percent"])

     PassengerId  Survived  Pclass                                       Name  \
61            62         1       1                        Icard, Miss. Amelie
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch  Ticket  Fare Cabin Embarked
61   female  38.0      0      0  113572  80.0   B28      NaN
829  female  62.0      0      0  113572  80.0   B28      NaN

     total    percent
S      644  72.278339
C      168  18.855219
Q       77   8.641975
NaN      2   0.224467

In [22]:
import matplotlib.pyplot as plt
fig = plt.figure()
fig.set(alpha=0.2)

[None]